东方青龙='角木蛟、亢金龙、氐土貉、房日兔、心月狐、尾火虎、箕水豹'.split('、')
北方玄武='斗木獬、牛金牛、女土蝠、虚日鼠、危月燕、室火猪、壁水貐'.split('、')
西方白虎='奎木狼、娄金狗、胃土雉、昴日鸡、毕月乌、嘴火猴、参水猿'.split('、')
南方朱雀='井木犴、鬼金羊、柳土獐、星日马、张月鹿、翼火蛇、轸水蚓'.split('、')

num ='''
角木蛟 昴日鸡 心月狐 昴日鸡 角木蛟 奎木狼 星日马 女土蝠 角木蛟 毕月乌 
牛金牛 心月狐 角木蛟 胃土雉 心月狐 井木犴 角木蛟 星日马 胃土雉 鬼金羊 
角木蛟 星日马 牛金牛 鬼金羊 角木蛟 翼火蛇 氐土貉 房日兔 角木蛟 昴日鸡 
室火猪 心月狐 角木蛟 毕月乌 翼火蛇 参水猿 角木蛟 亢金龙 鬼金羊 鬼金羊 
角木蛟 胃土雉 翼火蛇 氐土貉 角木蛟 昴日鸡 娄金狗 亢金龙 角木蛟 昴日鸡 
井木犴 昴日鸡 角木蛟 嘴火猴 氐土貉 鬼金羊 角木蛟 氐土貉 井木犴 柳土獐 
角木蛟 轸水蚓 昴日鸡 室火猪 角木蛟 昴日鸡 毕月乌 亢金龙 角木蛟 毕月乌 
斗木獬 角木蛟 角木蛟 胃土雉 轸水蚓 参水猿 角木蛟 亢金龙 柳土獐 柳土獐 
角木蛟 井木犴 虚日鼠 星日马 角木蛟 毕月乌 参水猿 危月燕 角木蛟 嘴火猴 
箕水豹 氐土貉 角木蛟 奎木狼 张月鹿 奎木狼 角木蛟 昴日鸡 氐土貉 轸水蚓 
角木蛟 井木犴 鬼金羊 心月狐'''.split()

flag=''
k=-1
for x in num:
    k=(k+1)%4
    if x in 东方青龙:
        flag+='1'
    if x in 北方玄武:
        flag+='0'
    if x in 西方白虎:
        flag+='2'
    if x in 南方朱雀:
        flag+='3'
    if k==3:flag+=' '
print(flag)
flag=flag.split()
real_flag=''
for x in range(len(flag)):
    real_flag+=chr(int(flag[x],4))
    print(int(flag[x],4))
print(real_flag)